Revit 2026 API

# ElectricalSystemHotConductorsNumber Property

---

The HotConductors Number of the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int HotConductorsNumber { get; }
```
```vb
Public ReadOnly Property HotConductorsNumber As Integer
	Get
```
```cpp
public:
property int HotConductorsNumber {
	int get ();
}
```
```fsharp
member HotConductorsNumber : int with get
```

#### Property Value

Int32

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This property only available when System Type is Power! |

This property is used to retrieve the HotConductors Number of the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace